/*
 Main
- Pages
    - 홈
        - 관리자 / 사용자 로그인 버튼
    - 관리자
        - 초기화 버튼, 전체 테이블 조회 버튼, 입력 버튼, 삭제 버튼, 변경 버튼
        - 초기화 완료 후 화면
        - 전체 테이블 띄울 화면
        - 입력할 테이블 고르는 화면, 선택한 테이블에 대한 속성을 넣을 창이 있는 화면
        - 삭제 화면
        - 변경 화면
    - 사용자
        - 영화 조회 버튼
            - 조회할 영화 정보 입력 칸
                - 조회된 영화 버튼
                    - 영화 정보 쫙 나오고 옆에 예매 버튼
                        - 좌석 화면
                            - 예매 진행 화면
        - 예매한 영화 조회 버튼
            - 예매한 영화 목록과 정보 + 삭제버튼, 변경버튼
                - 변경버튼 누를 시 영화 변경 / 상영일정 변경 선택 버튼
                    - 영화 변경시 영화 조회버튼 -> 예매과정
                    - 상영일정 변경시 이후 상영일정 조회 후 선택
- Components
    - Page에서 필요한 모든 기능
 */
 